@extends('layouts.client')

@push('title')
    <title>كتابي - سياسة الخصوصية</title>
@endpush

@section('content')
    <main id="privacy-terms">


        <div class="container">
            <h1 class="page-title"> سياسة الخصوصية </h1>
            <x-breadcrumb prevUrl="{{ route('client.home') }}" prevValue="الرئيسية" currUrl="{{ route('client.privacy') }}"
                currValue="سياسة الخصوصية " />
        </div>
        <div class="container">
            <div class="tp-wrapper">
                <div class="header">
                    <h2>سياسة الخصوصية</h2>
                    <p>أخر تحديث : 21 فيفري 2024</p>
                </div>
                <div class="content">
                    <!-- Start point -->
                    <div class="point">
                        <h3>عنوان</h3>
                        <div class="point-body">
                            <p>
                                هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص
                                العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد <a
                                    href="">مثال لرابط</a> التى يولدها التطبيق.
                            </p>
                        </div>
                    </div>
                    <!-- End point -->
                    <!-- Start point -->
                    <div class="point">
                        <h3>عنوان</h3>
                        <div class="point-body">
                            <p>
                                هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص
                                العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد <a
                                    href="">مثال لرابط</a> التى يولدها التطبيق.
                            </p>
                            <ul>
                                <li>هذا النص هو مثال لنص يمكن استبداله في نفس المساحة.</li>
                                <li>هذا النص هو مثال لنص يمكن استبداله في نفس المساحة.</li>
                                <li>هذا النص هو مثال لنص يمكن استبداله في نفس المساحة.</li>
                                <li>هذا النص هو مثال لنص يمكن استبداله في نفس المساحة.</li>
                                <li>هذا النص هو مثال لنص يمكن استبداله في نفس المساحة.</li>
                            </ul>
                        </div>
                    </div>
                    <!-- End point -->
                    <!-- Start point -->
                    <div class="point">
                        <h3>عنوان</h3>
                        <div class="point-body">
                            <p>
                                هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص
                                العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد <a
                                    href="">مثال لرابط</a> التى يولدها التطبيق.
                            </p>
                        </div>
                    </div>
                    <!-- End point -->
                    <!-- Start point -->
                    <div class="point">
                        <h3>عنوان</h3>
                        <div class="point-body">
                            <p>
                                هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص
                                العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد <a
                                    href="">مثال لرابط</a> التى يولدها التطبيق.
                            </p>
                        </div>
                    </div>
                    <!-- End point -->
                    <!-- Start point -->
                    <div class="point">
                        <h3>عنوان</h3>
                        <div class="point-body">
                            <p>
                                هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص
                                العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد <a
                                    href="">مثال لرابط</a> التى يولدها التطبيق.
                            </p>
                        </div>
                    </div>
                    <!-- End point -->
                </div>
            </div>
        </div>


    </main>
@endsection
